;; -*- no-byte-compile: t; -*-
;;; config/private/packages.el

(package! visual-regexp)
(package! visual-regexp-steroids)
(package! org-edit-latex)
(package! package-lint)
(package! keyfreq)
(package! evil-matchit)
(package! nsis-mode)
(package! groovy-mode)

(package! color-rg :recipe (:host github :repo "manateelazycat/color-rg"))

(package! auto-save :ignore t)
(package! openwith :ignore t)
